llm/step35_flash/b200/bench/bench_sharegpt_high.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='sharegpt', dataset_path='/data/bbuf/kda-pilot/llm/sharegpt/ShareGPT_V3_unfiltered_cleaned_split.json', model='stepfun-ai/Step-3.5-Flash', served_model_name=None, tokenizer=None, num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=100, output_file='/data/bbuf/kda-pilot/llm/step35_flash/b200/bench/sharegpt_high.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='sharegpt', dataset_path='/data/bbuf/kda-pilot/llm/sharegpt/ShareGPT_V3_unfiltered_cleaned_split.json', model='stepfun-ai/Step-3.5-Flash', served_model_name=None, tokenizer=None, num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=100, output_file='/data/bbuf/kda-pilot/llm/step35_flash/b200/bench/sharegpt_high.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 156324
#Output tokens: 92102
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 100       
Successful requests:                     500       
Benchmark duration (s):                  45.62     
Total input tokens:                      156324    
Total input text tokens:                 156324    
Total generated tokens:                  92102     
Total generated tokens (retokenized):    87838     
Request throughput (req/s):              10.96     
Input token throughput (tok/s):          3426.93   
Output token throughput (tok/s):         2019.06   
Peak output token throughput (tok/s):    4127.00   
Peak concurrent requests:                120       
Total token throughput (tok/s):          5445.99   
Concurrency:                             79.19     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   7224.74   
Median E2E Latency (ms):                 4674.89   
P90 E2E Latency (ms):                    17402.15  
P99 E2E Latency (ms):                    33360.15  
---------------Time to First Token----------------
Mean TTFT (ms):                          264.32    
Median TTFT (ms):                        130.10    
P99 TTFT (ms):                           810.37    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          42.63     
Median TPOT (ms):                        42.59     
P99 TPOT (ms):                           92.64     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           37.99     
Median ITL (ms):                         21.90     
P95 ITL (ms):                            91.93     
P99 ITL (ms):                            161.75    
Max ITL (ms):                            697.46    
==================================================